app/controllers/tasks_controller.rb

  def update
    @task.update!(task_params)
---
UPDATE "tasks" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["name", "テスト1"], ["description", "テスト投稿\r\n修正後"], ["updated_at", "2019-11-24 14:35:40.221933"], ["id", 1]]

  def destroy
    @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 2]]

  def create
    @task = current_user.tasks.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Rails学習"], ["description", ""], ["created_at", "2019-11-27 14:33:02.786915"], ["updated_at", "2019-11-27 14:33:02.786915"]]

  def set_task
    @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]