app/controllers/tasks_controller.rb

  def index
    @q = current_user.tasks.ransack(params[:q])
    @tasks = @q.result(distinct: true).page(params[:page])
---
SELECT "tasks".* FROM "tasks"